package tasks_05;

import java.text.SimpleDateFormat;
import java.util.Date;

public class task0528 {
/*
Вывести на экран сегодняшнюю дату
Вывести на экран текущую дату в аналогичном виде "21 02 2014".

Требования:
1. Дата должна содержать день, месяц и год, разделенные пробелом.
2. День должен соответствовать текущему.
3. Месяц должен соответствовать текущему.
4. Год должен соответствовать текущему.
5. Вся дата должна быть выведена в одной строке.

package com.javarush.task.task05.tasks_05.task0528;
import java.util.*;
import java.text.*;
/*
Вывести на экран сегодняшнюю дату
*/
/*
    public class Solution {
        public static void main(String[] args) {
            Date dateNow = new Date();
            SimpleDateFormat formatForDateNow = new SimpleDateFormat("dd MM yyyy");
            System.out.println(formatForDateNow.format(dateNow));
        }

 */
}
